drop database if exists run_competitions_db;

create database run_competitions_db;

use run_competitions_db;

create table competitions
(
	id INT AUTO_INCREMENT,
	title VARCHAR(255),
	image VARCHAR(255),/*the image path*/
	type_ VARCHAR(30),/*type of competition*/
	race_in_km FLOAT,/*how many kms the race will be*/
	location VARCHAR(100),/*the location of the race*/
	date_ INT,/*when the race starts, as timestamp*/
	duration_limit FLOAT,/*how many HOURS the race will go*/
	competitors_no INT,
	competitors_no_filled INT,
	registration_last_day INT,/*as timestamp*/
	cost FLOAT,/*how many euro it costs to participate*/
	rules TEXT,
	summary TEXT,
	creator_id INT,
	creation_time INT,
	PRIMARY KEY(id)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

INSERT INTO competitions (id, title, image, type_, race_in_km, location, date_, duration_limit, 
competitors_no, competitors_no_filled, registration_last_day, cost, summary, rules, creator_id, creation_time) 
VALUES ('1', '14ος Αγώνας Πανεπιστημίου Κρήτης', '../assets/images/1.png', 
'Αγώνας Δρόμου', '12.6', 'Πανεπιστημίου Κνωσού', '1485252000',
'1.50','100', '20', '1482915600', '15', 'Ο αγώνας με απόσταση 12.6 km θα ξεκινήσει στις 
09:00 πμ μπροστά από τα Λευκά κτήρια του Πανεπιστημίου στην Κνωσό και οι αθλητές θα ακολουθήσουν 
την διαδρομή Λ. Κνωσού, Λ. Δημοκρατίας, Πλατεία Ελευθερίας, Λ. Δικαιοσύνης, Λ. Καλοκαιρινού, Λ. 62 Μαρτύρων, 
Κόμβος Γιόφυρο, Δρόμος προς ΠΑΓΝΗ – Πανεπιστημιούπολη Βουτών. Δηλώσεις συμμετοχής θα γίνονται δεκτές ηλεκτρονικά  
μέσω της ιστοσελίδας http://unisport.uoc.gr/race-uni/race-match.html. 
Η μετάβαση των αθλητών από τον χώρο του τερματισμού,  στην αφετηρία θα γίνει με λεωφορείο που θα ξεκινήσει στις 08:20 π.μ.
Το πακέτο συμμετοχής περιλαμβάνει:

01. Αναμνηστικό μετάλλιο

02. Αριθμό αθλητή 

03. Ηλεκτρονική χρονομέτρηση

04. Αναμνηστικό δίπλωμα σε έντυπη ή ηλεκτρονική μορφή

05. Κλειστή διαδρομή στην κυκλοφορία των αυτοκινήτων

06. Διαχείρηση ιματισμού και προσωπικών αντικειμένων

07. Υγειονομική κάλυψη με WC στη διαδρομή

08.Έπαθλα ατομικά & ομαδικά. Συλολικά αθλοθετούνται 39 κύπελλα σε όλες τις διοργανώσεις.

10. Μπανάνα

12. Νερό

15. Λοιπά είδη, δώρα των χορηγών, υποστηρικτών

16. Απόδειξη  πληρωμής, μόνο στους αγώνες που έχουν αντίτιμο συμμετοχής', 
'Κανείς δεν θα έχει δικαίωμα συμμετοχής στους αγώνες, αν δεν έχει πρώτα εγγραφεί και εξασφαλίσει το νούμερο συμμετοχής του. 
Αθλητές που δεν θα διαθέτουν αριθμό συμμετοχής, τους παρακαλούμε να σεβαστούν τους υπόλοιπους συμμετέχοντες αθλητές, ενώ 
παράλληλα για λόγους ασφαλείας σε καμία περίπτωση να μην επιχειρήσουν να τρέξουν ξεκινώντας ή τερματίζοντας μαζί τους. 
Οι Αθλητές που θα αγνοήσουν την παραπάνω επισήμανση, τόσο στις εκκινήσεις όσο και στους τερματισμούς θα παρεμποδιστούν 
κατά την είσοδό τους. Οι διοργανωτές δεν αναλαμβάνουν κανένα είδος ευθύνης σε περίπτωση ατυχήματος ή ασθένειας κάθε μορφής.
Είναι υποχρεωτικό για όλους τους συμμετέχοντες να έχουν ασφάλεια ατυχήματος. Όλοι οι συμμετέχοντες αθλητές, κατά την υποβολή 
της αίτησης εγγραφής τους, πρώτα ενημερώνονται και στη συνέχεια συμφωνούν και υπογράφουν την ηλεκτρονική δήλωση αποποίησης ευθύνης, 
έναντι των διοργανωτών, των χορηγών, των εθελοντών και οποιουδήποτε άλλου εμπλέκεται καθοιονδήποτε τρόπον στη διεξαγωγή του εκάστοτε αγώνα ή το αμέσως μετά τη διεξαγωγή του χρονικό διάστημα.', 
'0','1480582800');

INSERT INTO competitions (id, title, image, type_, race_in_km, location, date_, duration_limit, 
competitors_no, competitors_no_filled, registration_last_day, cost, summary, rules, creator_id, creation_time) 
VALUES ('2', '14ος Ημιμαραθώνιος Τύρναβου', '../assets/images/2.png', 
'Αγώνας Δρόμου', '21.1', 'Κεντρική πλατεία Τυρνάβου', '1485684000',
'2.50','150', '70', '1482915600', '0', 
'Διαδρομή : 21,1 χλμ.: Επί του οδικού άξονα που ενώνει τις δύο πόλεις (Τύρναβο – Λάρισα) με παράκαμψη στο 5ο χλμ 
προς Αγία Σοφία – Δένδρα και στη συνέχεια  ξανά είσοδος στον άξονα έως την Γέφυρα Αλκαζάρ - Μητρ. Δωροθέου – Σκληρού – Γέφυρα 
ΔΕΥΑΛ – πεζόδρομος κοίτης Πηνειού – από τη Β΄ Γέφυρα Πηνειού είσοδος στην Καλλιθέας – Αθηνάς – Θέτιδος – Κύπρου – Κεντρική Πλατεία (Τερματισμός).
1η θέση κατηγορίας: κύπελλο, μετάλλιο & δίπλωμα.
2η & 3η θέση κατηγορίας: μετάλλιο & δίπλωμα.
Σε όλους τους δρομείς που θα τερματίσουν θα απονεμηθεί αναμνηστικό μετάλλιο και δίπλωμα.
Γενικά:

Η χρονομέτρηση θα γίνει με ηλεκτρονικό σύστημα.

Το σχετικό πακέτο (chip – αριθμός) θα δοθούν στην αφετηρία  μία ώρα πριν την έναρξη του αγώνα (10.00).
Σε όλο το μήκος της διαδρομής και κάθε 5 χλμ. θα υπάρχουν σταθμοί με νερά.

Οι αιτήσεις συμμετοχής θα πρέπει να υποβληθούν στο παρακάτω site. : "https://results.chronolog.gr/registration.aspx?h=a9b1a0e70376254d9297c1dbd7fe5f4f

Για τη διευκόλυνση των αθλητών, θα αναχωρήσει λεωφορείο την Κυριακή και  ώρα 9.00 από την κεντρική πλατεία της Λάρισας προς την αφετηρία. Το ίδιο δρομολόγιο θα επαναληφθεί και μετά το τέλος του αγώνα, για την εξυπηρέτηση των αθλητών που θα έχουν αφήσει αυτοκίνητα στην αφετηρία.

Σε όλους όσους συμμετάσχουν κανονικά στον αγώνα, θα δοθούν αναμνηστικά (Μετάλλιο – δίπλωμα συμμετοχής και Τεχνικό T-shirt).

Οι ενδιαφερόμενοι μπορούν να βρουν την ΑΙΤΗΣΗ ΣΥΜΜΕΤΟΧΗΣ και τον ΧΑΡΤΗ ΤΗΣ ΔΙΑΔΡΟΜΗΣ στο http://www.larissa-dimos.gr

ΔΕΝ ΘΑ ΓΙΝΟΝΤΑΙ ΕΓΓΡΑΦΕΣ ΤΗΝ ΗΜΕΡΑ ΤΟΥ ΑΓΩΝΑ
(ΟΣΟΙ ΕΡΘΟΥΝ ΘΑ ΣΥΜΜΕΤΕΧΟΥΝ ΕΚΤΟΣ ΣΥΝΑΓΩΝΙΣΜΟΥ)
', 
'Κάθε αθλητής συμμετέχει με δική του ευθύνη.
Aθλητές κάτω των 18 ετών συμμετέχουν με ευθύνη των γονέων τους. (Θα πρέπει να κατατεθεί υπεύθυνη δήλωση μαζί με τη δήλωση συμμετοχής).
', 
'0','1480582800');

INSERT INTO competitions (id, title, image, type_, race_in_km, location, date_, duration_limit, 
competitors_no, competitors_no_filled, registration_last_day, cost, summary, rules, creator_id, creation_time) 
VALUES ('3', '1ος Ημιμαραθώνιος Πρίνας', '../assets/images/3.png', 
'Αγώνας Δρόμου', '21.1', 'Πλατεία Πρίνας', '1485338400',
'2.50','50', '10', '1482915600', '15', 'Ο αγώνας με απόσταση 12.6 km θα ξεκινήσει στις 
09:00 πμ μπροστά από τα Λευκά κτήρια του Πανεπιστημίου στην Κνωσό και οι αθλητές θα ακολουθήσουν 
την διαδρομή Λ. Κνωσού, Λ. Δημοκρατίας, Πλατεία Ελευθερίας, Λ. Δικαιοσύνης, Λ. Καλοκαιρινού, Λ. 62 Μαρτύρων, 
Κόμβος Γιόφυρο, Δρόμος προς ΠΑΓΝΗ – Πανεπιστημιούπολη Βουτών. Δηλώσεις συμμετοχής θα γίνονται δεκτές ηλεκτρονικά  
μέσω της ιστοσελίδας http://unisport.uoc.gr/race-uni/race-match.html. 
Η μετάβαση των αθλητών από τον χώρο του τερματισμού,  στην αφετηρία θα γίνει με λεωφορείο που θα ξεκινήσει στις 08:20 π.μ.
Το πακέτο συμμετοχής περιλαμβάνει:

01. Αναμνηστικό μετάλλιο

02. Αριθμό αθλητή 

03. Ηλεκτρονική χρονομέτρηση

04. Αναμνηστικό δίπλωμα σε έντυπη ή ηλεκτρονική μορφή

05. Κλειστή διαδρομή στην κυκλοφορία των αυτοκινήτων

06. Διαχείρηση ιματισμού και προσωπικών αντικειμένων

07. Υγειονομική κάλυψη με WC στη διαδρομή

08.Έπαθλα ατομικά & ομαδικά. Συλολικά αθλοθετούνται 39 κύπελλα σε όλες τις διοργανώσεις.

10. Μπανάνα

12. Νερό

15. Λοιπά είδη, δώρα των χορηγών, υποστηρικτών

16. Απόδειξη  πληρωμής, μόνο στους αγώνες που έχουν αντίτιμο συμμετοχής', 
'Κανείς δεν θα έχει δικαίωμα συμμετοχής στους αγώνες, αν δεν έχει πρώτα εγγραφεί και εξασφαλίσει το νούμερο συμμετοχής του. 
Αθλητές που δεν θα διαθέτουν αριθμό συμμετοχής, τους παρακαλούμε να σεβαστούν τους υπόλοιπους συμμετέχοντες αθλητές, ενώ 
παράλληλα για λόγους ασφαλείας σε καμία περίπτωση να μην επιχειρήσουν να τρέξουν ξεκινώντας ή τερματίζοντας μαζί τους. 
Οι Αθλητές που θα αγνοήσουν την παραπάνω επισήμανση, τόσο στις εκκινήσεις όσο και στους τερματισμούς θα παρεμποδιστούν 
κατά την είσοδό τους. Οι διοργανωτές δεν αναλαμβάνουν κανένα είδος ευθύνης σε περίπτωση ατυχήματος ή ασθένειας κάθε μορφής.
Είναι υποχρεωτικό για όλους τους συμμετέχοντες να έχουν ασφάλεια ατυχήματος. Όλοι οι συμμετέχοντες αθλητές, κατά την υποβολή 
της αίτησης εγγραφής τους, πρώτα ενημερώνονται και στη συνέχεια συμφωνούν και υπογράφουν την ηλεκτρονική δήλωση αποποίησης ευθύνης, 
έναντι των διοργανωτών, των χορηγών, των εθελοντών και οποιουδήποτε άλλου εμπλέκεται καθοιονδήποτε τρόπον στη διεξαγωγή του εκάστοτε αγώνα ή το αμέσως μετά τη διεξαγωγή του χρονικό διάστημα.', 
'0','1480582800');

INSERT INTO competitions (id, title, image, type_, race_in_km, location, date_, duration_limit, 
competitors_no, competitors_no_filled, registration_last_day, cost, summary, rules, creator_id, creation_time) 
VALUES ('4', '5ος Φιλίππειος δρόμος', '../assets/images/4.png', 
'Αγώνας Δρόμου', '21.1', 'Βασιλικοί τάφοι Βεργίνας', '1485424800',
'2.50','50', '10', '1482915600', '15', 'Ο αγώνας με απόσταση 12.6 km θα ξεκινήσει στις 
09:00 πμ μπροστά από τα Λευκά κτήρια του Πανεπιστημίου στην Κνωσό και οι αθλητές θα ακολουθήσουν 
την διαδρομή Λ. Κνωσού, Λ. Δημοκρατίας, Πλατεία Ελευθερίας, Λ. Δικαιοσύνης, Λ. Καλοκαιρινού, Λ. 62 Μαρτύρων, 
Κόμβος Γιόφυρο, Δρόμος προς ΠΑΓΝΗ – Πανεπιστημιούπολη Βουτών. Δηλώσεις συμμετοχής θα γίνονται δεκτές ηλεκτρονικά  
μέσω της ιστοσελίδας http://unisport.uoc.gr/race-uni/race-match.html. 
Η μετάβαση των αθλητών από τον χώρο του τερματισμού,  στην αφετηρία θα γίνει με λεωφορείο που θα ξεκινήσει στις 08:20 π.μ.
Το πακέτο συμμετοχής περιλαμβάνει:

01. Αναμνηστικό μετάλλιο

02. Αριθμό αθλητή 

03. Ηλεκτρονική χρονομέτρηση

04. Αναμνηστικό δίπλωμα σε έντυπη ή ηλεκτρονική μορφή

05. Κλειστή διαδρομή στην κυκλοφορία των αυτοκινήτων

06. Διαχείρηση ιματισμού και προσωπικών αντικειμένων

07. Υγειονομική κάλυψη με WC στη διαδρομή

08.Έπαθλα ατομικά & ομαδικά. Συλολικά αθλοθετούνται 39 κύπελλα σε όλες τις διοργανώσεις.

10. Μπανάνα

12. Νερό

15. Λοιπά είδη, δώρα των χορηγών, υποστηρικτών

16. Απόδειξη  πληρωμής, μόνο στους αγώνες που έχουν αντίτιμο συμμετοχής', 
'Κανείς δεν θα έχει δικαίωμα συμμετοχής στους αγώνες, αν δεν έχει πρώτα εγγραφεί και εξασφαλίσει το νούμερο συμμετοχής του. 
Αθλητές που δεν θα διαθέτουν αριθμό συμμετοχής, τους παρακαλούμε να σεβαστούν τους υπόλοιπους συμμετέχοντες αθλητές, ενώ 
παράλληλα για λόγους ασφαλείας σε καμία περίπτωση να μην επιχειρήσουν να τρέξουν ξεκινώντας ή τερματίζοντας μαζί τους. 
Οι Αθλητές που θα αγνοήσουν την παραπάνω επισήμανση, τόσο στις εκκινήσεις όσο και στους τερματισμούς θα παρεμποδιστούν 
κατά την είσοδό τους. Οι διοργανωτές δεν αναλαμβάνουν κανένα είδος ευθύνης σε περίπτωση ατυχήματος ή ασθένειας κάθε μορφής.
Είναι υποχρεωτικό για όλους τους συμμετέχοντες να έχουν ασφάλεια ατυχήματος. Όλοι οι συμμετέχοντες αθλητές, κατά την υποβολή 
της αίτησης εγγραφής τους, πρώτα ενημερώνονται και στη συνέχεια συμφωνούν και υπογράφουν την ηλεκτρονική δήλωση αποποίησης ευθύνης, 
έναντι των διοργανωτών, των χορηγών, των εθελοντών και οποιουδήποτε άλλου εμπλέκεται καθοιονδήποτε τρόπον στη διεξαγωγή του εκάστοτε αγώνα ή το αμέσως μετά τη διεξαγωγή του χρονικό διάστημα.', 
'0','1480582800');


INSERT INTO competitions (id, title, image, type_, race_in_km, location, date_, duration_limit, 
competitors_no, competitors_no_filled, registration_last_day, cost, summary, rules, creator_id, creation_time) 
VALUES ('5', 'Γύρος Σητείας 2016', '../assets/images/5.png', 
'Αγώνας Δρόμου', '21.1', 'Δημαρχείο Σητείας', '1485511200',
'2.50','60', '30', '1482915600', '15', 'Ο αγώνας με απόσταση 12.6 km θα ξεκινήσει στις 
09:00 πμ μπροστά από τα Λευκά κτήρια του Πανεπιστημίου στην Κνωσό και οι αθλητές θα ακολουθήσουν 
την διαδρομή Λ. Κνωσού, Λ. Δημοκρατίας, Πλατεία Ελευθερίας, Λ. Δικαιοσύνης, Λ. Καλοκαιρινού, Λ. 62 Μαρτύρων, 
Κόμβος Γιόφυρο, Δρόμος προς ΠΑΓΝΗ – Πανεπιστημιούπολη Βουτών. Δηλώσεις συμμετοχής θα γίνονται δεκτές ηλεκτρονικά  
μέσω της ιστοσελίδας http://unisport.uoc.gr/race-uni/race-match.html. 
Η μετάβαση των αθλητών από τον χώρο του τερματισμού,  στην αφετηρία θα γίνει με λεωφορείο που θα ξεκινήσει στις 08:20 π.μ.
Το πακέτο συμμετοχής περιλαμβάνει:

01. Αναμνηστικό μετάλλιο

02. Αριθμό αθλητή 

03. Ηλεκτρονική χρονομέτρηση

04. Αναμνηστικό δίπλωμα σε έντυπη ή ηλεκτρονική μορφή

05. Κλειστή διαδρομή στην κυκλοφορία των αυτοκινήτων

06. Διαχείρηση ιματισμού και προσωπικών αντικειμένων

07. Υγειονομική κάλυψη με WC στη διαδρομή

08.Έπαθλα ατομικά & ομαδικά. Συλολικά αθλοθετούνται 39 κύπελλα σε όλες τις διοργανώσεις.

10. Μπανάνα

12. Νερό

15. Λοιπά είδη, δώρα των χορηγών, υποστηρικτών

16. Απόδειξη  πληρωμής, μόνο στους αγώνες που έχουν αντίτιμο συμμετοχής', 
'Κανείς δεν θα έχει δικαίωμα συμμετοχής στους αγώνες, αν δεν έχει πρώτα εγγραφεί και εξασφαλίσει το νούμερο συμμετοχής του. 
Αθλητές που δεν θα διαθέτουν αριθμό συμμετοχής, τους παρακαλούμε να σεβαστούν τους υπόλοιπους συμμετέχοντες αθλητές, ενώ 
παράλληλα για λόγους ασφαλείας σε καμία περίπτωση να μην επιχειρήσουν να τρέξουν ξεκινώντας ή τερματίζοντας μαζί τους. 
Οι Αθλητές που θα αγνοήσουν την παραπάνω επισήμανση, τόσο στις εκκινήσεις όσο και στους τερματισμούς θα παρεμποδιστούν 
κατά την είσοδό τους. Οι διοργανωτές δεν αναλαμβάνουν κανένα είδος ευθύνης σε περίπτωση ατυχήματος ή ασθένειας κάθε μορφής.
Είναι υποχρεωτικό για όλους τους συμμετέχοντες να έχουν ασφάλεια ατυχήματος. Όλοι οι συμμετέχοντες αθλητές, κατά την υποβολή 
της αίτησης εγγραφής τους, πρώτα ενημερώνονται και στη συνέχεια συμφωνούν και υπογράφουν την ηλεκτρονική δήλωση αποποίησης ευθύνης, 
έναντι των διοργανωτών, των χορηγών, των εθελοντών και οποιουδήποτε άλλου εμπλέκεται καθοιονδήποτε τρόπον στη διεξαγωγή του εκάστοτε αγώνα ή το αμέσως μετά τη διεξαγωγή του χρονικό διάστημα.', 
'0','1480582800');


INSERT INTO competitions (id, title, image, type_, race_in_km, location, date_, duration_limit, 
competitors_no, competitors_no_filled, registration_last_day, cost, summary, rules, creator_id, creation_time) 
VALUES ('6', 'Run the Lake 2016', '../assets/images/6.png', 
'Αγώνας Δρόμου', '21.1', 'Λίμνη Βουλιαγμένης', '1485597600',
'2.50','50', '20', '1482915600', '15', 'Ο αγώνας με απόσταση 12.6 km θα ξεκινήσει στις 
09:00 πμ μπροστά από τα Λευκά κτήρια του Πανεπιστημίου στην Κνωσό και οι αθλητές θα ακολουθήσουν 
την διαδρομή Λ. Κνωσού, Λ. Δημοκρατίας, Πλατεία Ελευθερίας, Λ. Δικαιοσύνης, Λ. Καλοκαιρινού, Λ. 62 Μαρτύρων, 
Κόμβος Γιόφυρο, Δρόμος προς ΠΑΓΝΗ – Πανεπιστημιούπολη Βουτών. Δηλώσεις συμμετοχής θα γίνονται δεκτές ηλεκτρονικά  
μέσω της ιστοσελίδας http://unisport.uoc.gr/race-uni/race-match.html. 
Η μετάβαση των αθλητών από τον χώρο του τερματισμού,  στην αφετηρία θα γίνει με λεωφορείο που θα ξεκινήσει στις 08:20 π.μ.
Το πακέτο συμμετοχής περιλαμβάνει:

01. Αναμνηστικό μετάλλιο

02. Αριθμό αθλητή 

03. Ηλεκτρονική χρονομέτρηση

04. Αναμνηστικό δίπλωμα σε έντυπη ή ηλεκτρονική μορφή

05. Κλειστή διαδρομή στην κυκλοφορία των αυτοκινήτων

06. Διαχείρηση ιματισμού και προσωπικών αντικειμένων

07. Υγειονομική κάλυψη με WC στη διαδρομή

08.Έπαθλα ατομικά & ομαδικά. Συλολικά αθλοθετούνται 39 κύπελλα σε όλες τις διοργανώσεις.

10. Μπανάνα

12. Νερό

15. Λοιπά είδη, δώρα των χορηγών, υποστηρικτών

16. Απόδειξη  πληρωμής, μόνο στους αγώνες που έχουν αντίτιμο συμμετοχής', 
'Κανείς δεν θα έχει δικαίωμα συμμετοχής στους αγώνες, αν δεν έχει πρώτα εγγραφεί και εξασφαλίσει το νούμερο συμμετοχής του. 
Αθλητές που δεν θα διαθέτουν αριθμό συμμετοχής, τους παρακαλούμε να σεβαστούν τους υπόλοιπους συμμετέχοντες αθλητές, ενώ 
παράλληλα για λόγους ασφαλείας σε καμία περίπτωση να μην επιχειρήσουν να τρέξουν ξεκινώντας ή τερματίζοντας μαζί τους. 
Οι Αθλητές που θα αγνοήσουν την παραπάνω επισήμανση, τόσο στις εκκινήσεις όσο και στους τερματισμούς θα παρεμποδιστούν 
κατά την είσοδό τους. Οι διοργανωτές δεν αναλαμβάνουν κανένα είδος ευθύνης σε περίπτωση ατυχήματος ή ασθένειας κάθε μορφής.
Είναι υποχρεωτικό για όλους τους συμμετέχοντες να έχουν ασφάλεια ατυχήματος. Όλοι οι συμμετέχοντες αθλητές, κατά την υποβολή 
της αίτησης εγγραφής τους, πρώτα ενημερώνονται και στη συνέχεια συμφωνούν και υπογράφουν την ηλεκτρονική δήλωση αποποίησης ευθύνης, 
έναντι των διοργανωτών, των χορηγών, των εθελοντών και οποιουδήποτε άλλου εμπλέκεται καθοιονδήποτε τρόπον στη διεξαγωγή του εκάστοτε αγώνα ή το αμέσως μετά τη διεξαγωγή του χρονικό διάστημα.', 
'0','1480582800');